[{"upc": "b4fd5943413e089a", "name": "Slow States of Collapse: Poems", "description": "The eagerly anticipated debut from one of Canadaâ\u0080\u0099s most exciting new poets In her debut collection, Ashley-Elizabeth Best explores the cultivation of resilience during uncertain and often trying times. Itâ\u0080\u0099s a book built around day-to-day conflicts â\u0080\u0094 poems about love, family, grief, power, and longing. Navigating the fault lines of popular culture and traditional poetry to The eagerly anticipated debut from one of Canadaâ\u0080\u0099s most exciting new poets In her debut collection, Ashley-Elizabeth Best explores the cultivation of resilience during uncertain and often trying times. Itâ\u0080\u0099s a book built around day-to-day conflicts â\u0080\u0094 poems about love, family, grief, power, and longing. Navigating the fault lines of popular culture and traditional poetry to assert that we are all history makers, Slow States of Collapse enters the landscape of personal narrative in an attempt to reconcile lifeâ\u0080\u0099s little universal griefs.Slow States of Collapse presents a world that is at once menacing and full of wonder and grace. Itâ\u0080\u0099s a poetry of â\u0080\u009ccasual crueltyâ\u0080\u009d and â\u0080\u009ckisses like / puncture wounds,â\u0080\u009d of â\u0080\u009csomething too tender to touchâ\u0080\u009d and â\u0080\u009cthe threat of an intense beauty.â\u0080\u009d In this collection, illness confronts bedside manners while a migrant restlessness also paints remarkable portraits of shifting self-image, and in the process the nature of personal and political power is reimagined.", "price": "57.31", "stock": "17", "image": "https://books.toscrape.com/../media/cache/db/ac/dbac3faca8a799824f5725d66c0fcce3.jpg"}, {"upc": "c8f7f0cb1abb9cac", "name": "Reasons to Stay Alive", "description": "I want life. I want to read it and write it and feel it and live it. I want, for as much of the time as possible in this blink-of-an-eye existence we have, to feel all that can be felt. I hate depression. I am scared of it. Terrified, in fact. But at the same time, it has made me who I am. And if - for me - it is the price of feeling life, it's a price always worth paying. I want life. I want to read it and write it and feel it and live it. I want, for as much of the time as possible in this blink-of-an-eye existence we have, to feel all that can be felt. I hate depression. I am scared of it. Terrified, in fact. But at the same time, it has made me who I am. And if - for me - it is the price of feeling life, it's a price always worth paying.Reasons to Stay Alive is about making the most of your time on earth. In the western world the suicide rate is highest amongst men under the age of 35. Matt Haig could have added to that statistic when, aged 24, he found himself staring at a cliff-edge about to jump off. This is the story of why he didn't, how he recovered and learned to live with anxiety and depression. It's also an upbeat, joyous and very funny exploration of how live better, love better, read better and feel more.", "price": "26.41", "stock": "17", "image": "https://books.toscrape.com/../media/cache/f5/3c/f53c7d21723c860cfbca2b539bc55b8f.jpg"}, {"upc": "b12b89017878a60d", "name": "Private Paris (Private #10)", "description": "Paris is burning--and only Private's Jack Morgan can put out the fire.When Jack Morgan stops by Private's Paris office, he envisions a quick hello during an otherwise relaxing trip filled with fine food and sightseeing. But Jack is quickly pressed into duty after a call from his client Sherman Wilkerson, asking Jack to track down his young granddaughter who is on the run f Paris is burning--and only Private's Jack Morgan can put out the fire.When Jack Morgan stops by Private's Paris office, he envisions a quick hello during an otherwise relaxing trip filled with fine food and sightseeing. But Jack is quickly pressed into duty after a call from his client Sherman Wilkerson, asking Jack to track down his young granddaughter who is on the run from a brutal drug dealer.Before Jack can locate her, several members of France's cultural elite are found dead--murdered in stunning, symbolic fashion. The only link between the crimes is a mysterious graffiti tag. As religious and ethnic tensions simmer in the City of Lights, only Jack and his Private team can connect the dots before the smoldering powder keg explodes.", "price": "47.61", "stock": "17", "image": "https://books.toscrape.com/../media/cache/05/87/0587ab519222a61f803fa4570c325ad2.jpg"}, {"upc": "c27f6e1f185b0383", "name": "#HigherSelfie: Wake Up Your Life. Free Your Soul. Find Your Tribe.", "description": "There is a cosmic alarm clock going off around the world! #HigherSelfie's aim is to unite all those waking up spiritually in this digital age. This book is a guide to love, connection, and kickass surrendered action for young people who have at least a toe in the door of spirituality. With a no-nonsense approach and full of wit and humor, this book shares age-old concepts There is a cosmic alarm clock going off around the world! #HigherSelfie's aim is to unite all those waking up spiritually in this digital age. This book is a guide to love, connection, and kickass surrendered action for young people who have at least a toe in the door of spirituality. With a no-nonsense approach and full of wit and humor, this book shares age-old concepts in a language that is accessible to the modern spiritual audience. Whether you have just bought a yoga mat or have been meditating for years, this book will offer you guidance and support, whatever stage of the journey you're at. Life coaches Jo Westwood and Lucy Sheridan touch upon timeless topics such as forgiveness, surrender and the ego, as well as subjects specific to the current age, such as using social media in a healthy way, finding a like-minded tribe, and following your own spiritual and life paths without comparing yourself to others. Whether you're a Reiki master, climbing the corporate ladder or working in a suburban garden center #HigherSelfie will be the perfect â\u0080\u0098gateway drugâ\u0080\u0099 for those looking for something deeper and more meaningful.", "price": "23.11", "stock": "17", "image": "https://books.toscrape.com/../media/cache/71/45/71451e3bba61a8d888a4a2c6526a4bcf.jpg"}, {"upc": "acddfeab2a407640", "name": "Without Borders (Wanderlove #1)", "description": "For Annie London, a month in a Central American rainforest means handing out mosquito nets, giving medical aid, and teaching children about the birds and the bees. With any luck, it will also land her application in the â\u0080\u009cacceptedâ\u0080\u009d pile at a top tier medical school. But as soon as she steps off the plane, Annie realizes her bug spray, feeble Spanish, and medical supplies wo For Annie London, a month in a Central American rainforest means handing out mosquito nets, giving medical aid, and teaching children about the birds and the bees. With any luck, it will also land her application in the â\u0080\u009cacceptedâ\u0080\u009d pile at a top tier medical school. But as soon as she steps off the plane, Annie realizes her bug spray, feeble Spanish, and medical supplies wonâ\u0080\u0099t help her deal with her new feelings for Felipeâ\u0080\u0094her best friend's older brother, who's much hotter than she remembers, and who also happens to be the doctor in charge of the trip.Gawking â\u0080\u009cvolun-touristsâ\u0080\u009d may keep his familyâ\u0080\u0099s medical clinic afloat, but Dr. Felipe Gutierrez doesnâ\u0080\u0099t have to like them. Or the way they make snap judgments about his practice and the people he cares for. But when his old crush, Annie, shows up to volunteer, her killer curves and kind smile fan the embers of a flame Felipe didnâ\u0080\u0099t realize heâ\u0080\u0099d been carrying. A flame that makes him question all his preconceived notions.As ideas and cultures clash, Annie and Felipe must decide how far outside their comfort zones they are willing to goâ\u0080\u0094both for their work and for one another.", "price": "45.07", "stock": "16", "image": "https://books.toscrape.com/../media/cache/de/26/de269ee688d4dc51846567f3942600ce.jpg"}, {"upc": "3ecb690d1542c568", "name": "When We Collided", "description": "We are seventeen and shattered and still dancing. We have messy, throbbing hearts, and we are stronger than anyone could ever knowâ\u0080¦Jonah never thought a girl like Vivi would come along.Vivi didnâ\u0080\u0099t know Jonah would light up her world.Neither of them expected a summer like thisâ\u0080¦a summer that would rewrite their futures.In an unflinching story about new love, old wounds, and We are seventeen and shattered and still dancing. We have messy, throbbing hearts, and we are stronger than anyone could ever knowâ\u0080¦Jonah never thought a girl like Vivi would come along.Vivi didnâ\u0080\u0099t know Jonah would light up her world.Neither of them expected a summer like thisâ\u0080¦a summer that would rewrite their futures.In an unflinching story about new love, old wounds, and forces beyond our control, two teens find that when you collide with the right person at just the right time, it will change you forever.", "price": "31.77", "stock": "16", "image": "https://books.toscrape.com/../media/cache/17/db/17db3de71e8217d4277a9328b04f56cf.jpg"}, {"upc": "8d455c7539795d2a", "name": "We Love You, Charlie Freeman", "description": "The Freeman family--Charles, Laurel, and their daughters, teenage Charlotte and nine-year-old Callie--have been invited to the Toneybee Institute in rural Massachusetts to participate in a research experiment. They will live in an apartment on campus with Charlie, a young chimp abandoned by his mother. The Freemans were selected for the experiment because they know sign la The Freeman family--Charles, Laurel, and their daughters, teenage Charlotte and nine-year-old Callie--have been invited to the Toneybee Institute in rural Massachusetts to participate in a research experiment. They will live in an apartment on campus with Charlie, a young chimp abandoned by his mother. The Freemans were selected for the experiment because they know sign language; they are supposed to teach it to Charlie and welcome him as a member of their family. Isolated in their new, nearly all-white community not just by their race but by their strange living situation, the Freemans come undone. And when Charlotte discovers the truth about the Instituteâ\u0080\u0099s history of questionable studies, the secrets of the past begin to invade the present. The power of this novel resides in Kaitlyn Greenidgeâ\u0080\u0099s undeniable storytelling talents. What appears to be a story of mothers and daughters, of sisterhood put to the test, of adolescent love and grown-up misconduct, and of historyâ\u0080\u0099s long reach, becomes a provocative and compelling exploration of Americaâ\u0080\u0099s failure to find a language to talk about race.", "price": "50.27", "stock": "16", "image": "https://books.toscrape.com/../media/cache/87/a2/87a2fddd7f6b240c0351e1eb950b6716.jpg"}, {"upc": "657fe5ead67a7767", "name": "Untitled Collection: Sabbath Poems 2014", "description": "More than thirty-five years ago, when the weather allowed, Wendell Berry began spending his sabbaths outdoors, walking and wandering around familiar territory, seeking a deep intimacy only time could provide. These walks arranged themselves into poems and each year since he has completed a sequence dated by the year of its composition. Last year we collected the lot into a More than thirty-five years ago, when the weather allowed, Wendell Berry began spending his sabbaths outdoors, walking and wandering around familiar territory, seeking a deep intimacy only time could provide. These walks arranged themselves into poems and each year since he has completed a sequence dated by the year of its composition. Last year we collected the lot into a collection, This Day, the Sabbath Poems 1979-2013. This new sequence for the following year is one of the richest yet. This group provides a virtual syllabus for all of Mr. Berryâ\u0080\u0099s cultural and agricultural work in concentrated form. Many of these poems are drawn from the view from a small porch in the woods, a place of stillness and reflection, a vantage point â\u0080\u009cof the one/life of the forest composed/of uncountable lives in countless/years each life coherent itself within/ the coherence, the great composure,/of all.â\u0080\u009d A new collection of Wendell Berry poems is always an occasion of joyful celebration and this one is especially so.", "price": "14.27", "stock": "16", "image": "https://books.toscrape.com/../media/cache/65/6e/656e79dfd4f8b6bf19ffde2c75ceda81.jpg"}, {"upc": "d170b5a0da46380e", "name": "Unseen City: The Majesty of Pigeons, the Discreet Charm of Snails & Other Wonders of the Urban Wilderness", "description": "It all started with Nathanael Johnsonâ\u0080\u0099s decision to teach his daughter the name of every tree they passed on their walk to day care in San Francisco. This project turned into a quest to discover the secrets of the neighborhoodâ\u0080\u0099s flora and fauna, and yielded more than names and trivia: Johnson developed a relationship with his nonhuman neighbors.Johnson argues that learning It all started with Nathanael Johnsonâ\u0080\u0099s decision to teach his daughter the name of every tree they passed on their walk to day care in San Francisco. This project turned into a quest to discover the secrets of the neighborhoodâ\u0080\u0099s flora and fauna, and yielded more than names and trivia: Johnson developed a relationship with his nonhuman neighbors.Johnson argues that learning to see the world afresh, like a child, shifts the way we think about nature: Instead of something distant and abstract, nature becomes realâ\u0080\u0094all at once comical, annoying, and beautiful. This shift can add tremendous value to our lives, and it might just be the first step in saving the world.No matter where we liveâ\u0080\u0094city, country, oceanside, ormountainsâ\u0080\u0094there are wonders that we walk past every day. Unseen City widens the pinhole of our perspective by allowing us to view the world from the high-altitude eyes of a turkey vulture and the distinctly low-altitude eyes of a snail. The narrative allows us to eavesdrop on the comically frenetic life of a squirrel and peer deep into the past with a ginkgo biloba tree. Each of these organisms has something unique to tell us about our neighborhoods and, chapter by chapter, Unseen City takes us on a journey that is part nature lesson and part love letter to the worldâ\u0080\u0099s urban jungles. With the right perspective, a walk to the subway can be every bit as entrancing as a walk through a national park.", "price": "44.18", "stock": "16", "image": "https://books.toscrape.com/../media/cache/88/a4/88a4b5f7236b8a36ba972be5ebe4f252.jpg"}, {"upc": "7ae099f3898e0209", "name": "Unicorn Tracks", "description": "After a savage attack drives her from her home, sixteen-year-old Mnemba finds a place in her cousin Tumeloâ\u0080\u0099s successful safari business, where she quickly excels as a guide. Surrounding herself with nature and the mystical animals inhabiting the savannah not only allows Mnembaâ\u0080\u0099s tracking skills to shine, it helps her to hide from the terrible memories that haunt her.Mnemba After a savage attack drives her from her home, sixteen-year-old Mnemba finds a place in her cousin Tumeloâ\u0080\u0099s successful safari business, where she quickly excels as a guide. Surrounding herself with nature and the mystical animals inhabiting the savannah not only allows Mnembaâ\u0080\u0099s tracking skills to shine, it helps her to hide from the terrible memories that haunt her.Mnemba is employed to guide Mr. Harving and his daughter, Kara, through the wilderness as they study unicorns. The young women are drawn to each other, despite that fact that Kara is betrothed. During their research, they discover a conspiracy by a group of poachers to capture the Unicorns and exploit their supernatural strength to build a railway. Together, they must find a way to protect the creatures Kara adores while resisting the love they know they can never indulge.", "price": "18.78", "stock": "16", "image": "https://books.toscrape.com/../media/cache/9b/09/9b0935dc936c92900c2dc5d2114da72f.jpg"}, {"upc": "9a9d6e9bc555731e", "name": "Unbound: How Eight Technologies Made Us Human, Transformed Society, and Brought Our World to the Brink", "description": "Although we usually think of technology as something unique to modern times, our ancestors began to create the first technologies millions of years ago in the form of prehistoric tools and weapons. Over time, eight key technologies gradually freed us from the limitations of our animal origins.The fabrication of weapons, the mastery of fire, and the technologies of clothing Although we usually think of technology as something unique to modern times, our ancestors began to create the first technologies millions of years ago in the form of prehistoric tools and weapons. Over time, eight key technologies gradually freed us from the limitations of our animal origins.The fabrication of weapons, the mastery of fire, and the technologies of clothing and shelter radically restructured the human body, enabling us to walk upright, shed our body hair, and migrate out of tropical Africa. Symbolic communication transformed human evolution from a slow biological process into a fast cultural process. The invention of agriculture revolutionized the relationship between humanity and the environment, and the technologies of interaction led to the birth of civilization. Precision machinery spawned the industrial revolution and the rise of nation-states; and in the next metamorphosis, digital technologies may well unite all of humanity for the benefit of future generations.Synthesizing the findings of primatology, paleontology, archeology, history, and anthropology, Richard Currier reinterprets and retells the modern narrative of human evolution that began with the discovery of Lucy and other Australopithecus fossils. But the same forces that allowed us to integrate technology into every aspect of our daily lives have also brought us to the brink of planetary catastrophe. Unbound explains both how we got here and how human society must be transformed again to achieve a sustainable future.Technology: â\u0080\u009cThe deliberate modification of any natural object or substance with forethought to achieve a specific end or to serve a specific purpose.â\u0080\u009d", "price": "25.52", "stock": "16", "image": "https://books.toscrape.com/../media/cache/27/a1/27a1ebe79d6e6759ec68ea9f427a4f71.jpg"}, {"upc": "09555be379ad9253", "name": "Tsubasa: WoRLD CHRoNiCLE 2 (Tsubasa WoRLD CHRoNiCLE #2)", "description": "DUAL WORLDS, DUAL SIGHTS In the land of Nirai Kanai, there are two realms, one that is the \"outside\" world, and another that is \"inside\" and hidden from the rest of reality. At the request of the holy Himegami, Syaoran ventures into this inside realm to investigate an anomaly, but what he sees there is very different from what Fai and Kurogane see. What does this discrepa DUAL WORLDS, DUAL SIGHTS Â  In the land of Nirai Kanai, there are two realms, one that is the \"outside\" world, and another that is \"inside\" and hidden from the rest of reality. At the request of the holy Himegami, Syaoran ventures into this inside realm to investigate an anomaly, but what he sees there is very different from what Fai and Kurogane see. What does this discrepancy mean, and what can they do to overcome it?!", "price": "16.28", "stock": "16", "image": "https://books.toscrape.com/../media/cache/8b/ab/8bab133ec9f8248a8d5f5ea5c09d0f56.jpg"}, {"upc": "7858914fad68493c", "name": "Throwing Rocks at the Google Bus: How Growth Became the Enemy of Prosperity", "description": "Capital in the Twenty-First Century meets The Second Machine Age in this stunning and optimistic tour de force on the promise and peril of the digital economy, from one of the most brilliant social critics of our time. Digital technology was supposed to usher in a new age of endless prosperity, but so far it has been used to put industrial capitalism on steroids, makin Capital in the Twenty-First Century meets The Second Machine Age in this stunning and optimistic tour de force on the promise and peril of the digital economy, from one of the most brilliant social critics of our time. Digital technology was supposed to usher in a new age of endless prosperity, but so far it has been used to put industrial capitalism on steroids, making it harder for people and businesses to keep up. Social networks surrender their original missions to more immediately profitable data mining, while brokerage houses abandon value investing for algorithms that drain markets and our 401ks alike--all tactics driven by the need to stoke growth by any means necessary. Instead of taking this opportunity to reprogram our economy for sustainability, we have doubled down on growth as its core command. We have reached the limits of this approach. We must escape the growth trap, once and for all.Â Media scholar and technology author Douglas Rushkoff--one of today's most original and influential thinkers--argues for a new economic program that utilizes the unique distributive power of the internet while breaking free of the winner-take-all system the growth trap leaves in its wake. Drawing on sources both contemporary and historical, Rushkoff pioneers a new understanding of the old economic paradigm, from central currency to debt to corporations and labor.Most importantly, he offers a series of practical steps for businesses, consumers, investors, and policymakers to remake the economic operating system from the inside out--and prosper along the way. Instead of boycotting Wal-Mart or overtaxing the wealthy, we simply implement strategies that foster the creation of value by stakeholders other than just ourselves. From our currency to our labor to the corporation, every aspect of the economy can be reprogrammed with minimal disruption to create a more equitably distributed prosperity for all.Inspiring and challenging, Throwing Rocks at the Google Bus provides a pragmatic, optimistic, and human-centered model for economic progress in the digital age.", "price": "31.12", "stock": "16", "image": "https://books.toscrape.com/../media/cache/f4/21/f4210912ca58ef35f8ad120fe3dfed38.jpg"}, {"upc": "51653ef291ab7ddc", "name": "This One Summer", "description": "Every summer, Rose goes with her mom and dad to a lake house in Awago Beach. It's their getaway, their refuge. Rosie's friend Windy is always there, too, like the little sister she never had. But this summer is different. Rose's mom and dad won't stop fighting, and when Rose and Windy seek a distraction from the drama, they find themselves with a whole new set of problems. Every summer, Rose goes with her mom and dad to a lake house in Awago Beach. It's their getaway, their refuge. Rosie's friend Windy is always there, too, like the little sister she never had. But this summer is different. Rose's mom and dad won't stop fighting, and when Rose and Windy seek a distraction from the drama, they find themselves with a whole new set of problems. It's a summer of secrets and sorrow and growing up, and it's a good thing Rose and Windy have each other.In This One Summer two stellar creators redefine the teen graphic novel. Cousins Mariko and Jillian Tamaki, the team behind Skim, have collaborated on this gorgeous, heartbreaking, and ultimately hopeful story about a girl on the cusp of her teen age â\u0080\u0094 a story of renewal and revelation.", "price": "19.49", "stock": "16", "image": "https://books.toscrape.com/../media/cache/ee/43/ee4364a59d66bafb1b3264419ab3ed9e.jpg"}, {"upc": "709822d0b5bcb7f4", "name": "Thirst", "description": "On a searing summer Friday, Eddie Chapman has been stuck for hours in a traffic jam. There are accidents along the highway, but ambulances and police are conspicuously absent. When he decides to abandon his car and run home, he sees that the trees along the edge of a stream have been burnt, and the water in the streambed is gone. Something is very wrong.When he arrives hom On a searing summer Friday, Eddie Chapman has been stuck for hours in a traffic jam. There are accidents along the highway, but ambulances and police are conspicuously absent. When he decides to abandon his car and run home, he sees that the trees along the edge of a stream have been burnt, and the water in the streambed is gone. Something is very wrong.When he arrives home, the power is out and there is no running water. The pipes everywhere, it seems, have gone dry. Eddie and his wife, Laura, find themselves thrust together with their neighbors while a sense of unease thickens in the stifling night air. Thirst takes place in the immediate aftermath of a mysterious disaster--the Chapmans and their neighbors suffer the effects of the heat, their thirst, and the terrifying realization that no one is coming to help. As violence rips through the community, Eddie and Laura are forced to recall secrets from their past and question their present humanity. In crisp and convincing prose, Ben Warner compels readers to do the same. What might you do to survive?", "price": "17.27", "stock": "16", "image": "https://books.toscrape.com/../media/cache/8c/54/8c54a50576c204b80165a13545f73028.jpg"}, {"upc": "4eed62cf5f8d8edf", "name": "The Torch Is Passed: A Harding Family Story", "description": "Andrea Harding is a recent college graduate looking forward to attending Duke Law School when her world is turned upside down by the shooting of her father, Nicholas, and uncle, Michael, in a surprising and puzzling attack. They are the only family she has, aside from her paternal grandmother Dorothy, so when her uncle dies from the attack and her father lays comatose in I Andrea Harding is a recent college graduate looking forward to attending Duke Law School when her world is turned upside down by the shooting of her father, Nicholas, and uncle, Michael, in a surprising and puzzling attack. They are the only family she has, aside from her paternal grandmother Dorothy, so when her uncle dies from the attack and her father lays comatose in ICU, it falls to Andrea to not only investigate who would want to kill her father and uncle, but also to oversee Harding Industries, the family company. When her fatherâ\u0080\u0099s longtime attorney and one of a handful of family friends, Beth Cowling, rushes to help Andrea long distance, the youngest Harding soon finds herself surrounded by a bevy of intriguing new friends and helpers. First to arrive is Bethâ\u0080\u0099s own daughter, Riva, acting as Andreaâ\u0080\u0099s attorney after Andrea is violently attacked in her fatherâ\u0080\u0099s home, where she grew up, forcing her to kill both would-be assassins. When Nicholasâ\u0080\u0099s on again/off again lover, state prosecutor and gubernatorial hopeful Kerry Marcus, is equally at a loss to name suspects in the Harding family attacks, Riva begins her own investigation into the short list of family friends and colleagues, including Don Marshall, former colleague of Nicholasâ\u0080\u0099s at Marshall Pharmaceutical, which Don now runs, and Donâ\u0080\u0099s wife Karen. Marshall has a shady past, including an incident at his company that also involved Andreaâ\u0080\u0099s father. She also looks closely at Marcus Ricci, father of Andreaâ\u0080\u0099s closest high school friend, Jason. After Jasonâ\u0080\u0099s death from leukemia, Ricci becomes like a second father to Andrea. Ricci is also widely believed to have ties to the New Jersey mob. But Beth has another contact she wants involved in the investigation, Deirdre Southington, daughter of Bethâ\u0080\u0099s old friend Cordelia Southington. The Southington family has more money than God, as well as, through Deirdre, more contacts in the intriguing world of international espionage. A former NSA agent, Deirdre is mysterious and beautiful in a cold way. An eccentric who travels via private rail car, she is also extraordinarily persuasive, holding a PhD in forensic psychology that she has put to great use in both her work with the NSA and on her own, as a defender of good, rooting out evil doers and ensuring they are brought to her own brand of justice. Andrea, Riva, and Deirdre all also cast a suspicious eye on the Oakes brothers, Carlton and Jefferson, who run Oakes Industries along with their silent partner and cousin, New Jersey state senator Schuyler Colfax, who also has his eye on the governorâ\u0080\u0099s seat. Oakes Industries has recently made an attempt to purchase Harding Industries, a seemingly irrational move that is rebuffed by Nicholas. What no one knows until much later is that the Oakes brothers have entered into a business deal with Russian mobster Viktor Roman, who represents the real party interested in acquiring Harding Industries, a Vor, Russian organized crime unit, with heavy international interests in the energy sector. Andrea matures quickly as she rapidly learns who she can and cannot trust during her search for the people out to kill her family. Along with her new friends and advocates, she discovers Harding Industries holds a soon to expire option to buy property that could become the source of untold billions from oil reserves, and moves in the nick of time to exercise their right to purchase. But the biggest blow for the Harding family is yet to comeâ\u0080\u0094the discovery that Viktor Roman has promised Kerry Marcus the governorâ\u0080\u0099s seat in exchange for information about the Hardings, including Nicholas and Michaelâ\u0080\u0099s whereabouts on the night they are shot. Ultimately, Andrea chooses to forego law school and becomes her fatherâ\u0080\u0099s new partner in Harding Industries, no doubt with many adventures yet to come. Masterfully told using a smattering of historical facts along with a soundtrack of classical music masterpieces, this thriller keeps readers on edge until the very end.", "price": "19.09", "stock": "16", "image": "https://books.toscrape.com/../media/cache/c7/26/c7260547c468dbe78af92cf3927c2a1c.jpg"}, {"upc": "b5ea0b5dabed25a8", "name": "The Secret of Dreadwillow Carse", "description": "A princess and a peasant girl must embark on a dangerous quest to outwit a centuries-old warning foretelling the fall of the Monarchy in this modern fairytale. In the center of the verdant Monarchy lies Dreadwillow Carse, a black and desolate bog that the happy people of the land do their best to ignore. Little is known about it, except for one dire warning: If any monarc A princess and a peasant girl must embark on a dangerous quest to outwit a centuries-old warning foretelling the fall of the Monarchy in this modern fairytale. Â  In the center of the verdant Monarchy lies Dreadwillow Carse, a black and desolate bog that the happy people of the land do their best to ignore. Little is known about it, except for one dire warning: If any monarch enters Dreadwillow Carse, then the Monarchy will fall.Â Twelve-year-old Princess Jeniah yearns to know what the marsh could possibly conceal that might topple her familyâ\u0080\u0099s thousand-year reign of peace and prosperity. Meanwhile, in the nearby town of Emberfell, where everyone lives with unending joy, a girl named Aon hides a sorrow she can never reveal. She knows that something in the carse--something that sings a haunting tune only Aon can hear--holds the cure for her sadness. Yet no matter how many times she tries to enter, the terror-inducing dreadwillow trees keep her away. After a chance meeting, Princess Jeniah and Aon hatch a plan to send Aon into the heart of the carse to unlock its darkest secret. But when Aon doesnâ\u0080\u0099t return, a guilt-stricken Jeniah must enter the carse to try and rescue her friend--even if it means risking the entire Monarchy.", "price": "56.13", "stock": "16", "image": "https://books.toscrape.com/../media/cache/7b/fd/7bfde4a3d6793f13e9a2d8851a398847.jpg"}, {"upc": "142d767a56a9254d", "name": "The Pioneer Woman Cooks: Dinnertime: Comfort Classics, Freezer Food, 16-Minute Meals, and Other Delicious Ways to Solve Supper!", "description": "THEREâ\u0080\u0099S NO TIME LIKE DINNERTIME!Oh, donâ\u0080\u0099t get me wrong. I adore breakfast. I love lunch! But dinnertime definitely tops them all. Itâ\u0080\u0099s the time of day when we reunite with our sweeties, our kids, our friends, our parents . . . and catch up on the events of the day over something mouthwatering and delicious. Dinnertime anchors us, nourishes us, and reassures us. Itâ\u0080\u0099s the gr THEREâ\u0080\u0099S NO TIME LIKE DINNERTIME!Oh, donâ\u0080\u0099t get me wrong. I adore breakfast. I love lunch! But dinnertime definitely tops them all. Itâ\u0080\u0099s the time of day when we reunite with our sweeties, our kids, our friends, our parents . . . and catch up on the events of the day over something mouthwatering and delicious. Dinnertime anchors us, nourishes us, and reassures us. Itâ\u0080\u0099s the greatest meal of the day!Â The Pioneer Woman Cooks: Dinnertime is a beloved collection of all the scrumptious supper recipes that make their way through my kitchen in regular rotation, from main dish salads to satisfying soups to hearty casseroles to comfort food classics . . . and everything in between. I lay out all the different ways I tackle dinner in my house, from super-quick 16-Minute Meals to make-ahead Freezer Food to irresistible pastas and a bundle of brand-new favorites of my crew.Youâ\u0080\u0099ll want to immediately dive into surefire hits like Tomato Soup with Parmesan Croutons, Buffalo Chicken Salad, Baked Ziti, and Shrimp Scampi. But just wait till you try the Cashew Chicken, French Dip Sandwiches, Chicken Marsala, and Beef Stroganoff. And donâ\u0080\u0099t even get me started on the Tomato Tart, Chicken with Mustard Cream Sauce, and Pan-Fried Pork Chops. Youâ\u0080\u0099ll have a very tough time deciding on a favorite!To take away the guesswork, I made sure to include all the step-by-step recipe photos I love to share, and I packed as much deliciousness into each chapter as possible. My hope is that you will turn to this book regularly to solve your dinnertime dilemmas, and that you will use these recipes to feed your family time and time again. The more stains, smudges, and smears on the pages, the better!Enjoy dinnertime in your household, friends!", "price": "56.41", "stock": "16", "image": "https://books.toscrape.com/../media/cache/fd/af/fdaf3c3104c559941c01e840fecd2659.jpg"}, {"upc": "5ee94540d0749ea0", "name": "The Past Never Ends", "description": "A simple task, Attorney Chester Morgan thinks. Get a copy of a public record for a young man whose only friend has died in an unexplained accidental death. Except... The police file regarding the demise of sex worker Tanya Everly has been sealed by the order of the chief of police, and no one will talk. Warned to drop the matter, Attorney Morgan knows that if he doesn't sp A simple task, Attorney Chester Morgan thinks. Get a copy of a public record for a young man whose only friend has died in an unexplained accidental death. Except... The police file regarding the demise of sex worker Tanya Everly has been sealed by the order of the chief of police, and no one will talk. Warned to drop the matter, Attorney Morgan knows that if he doesn't speak for the dead young woman, no one will. Haunted by his discovery of the body of a prominent local oilman, Morgan pursues a quest for justice that puts his reputation, career, and life at risk. A journey that takes him into the dark shadows of the sex-for-sale business, into the marble courtrooms of Oklahoma, and into the aching loneliness of his own soul. Set in the American Southwest in the days before 9/11, The Past Never Ends is both a complex murder mystery and a meditation on the self-perpetuating nature of injustice and the ethereal nature of justice itself.", "price": "56.50", "stock": "16", "image": "https://books.toscrape.com/../media/cache/9d/f2/9df248dcefeaba9eeb519a59b248f72c.jpg"}, {"upc": "cedf82b5086e4691", "name": "The Natural History of Us (The Fine Art of Pretending #2)", "description": "One class assignment. One second chance at love. The school player is all in. Now he needs to win back the sweet commitment girl who's forever owned his heart. Justin Carter has a secret. He's not the total player Fairfield Academy believes him to be. Not really. In fact, he used to be a one-woman guy...and his feelings for her never went away. Too bad he broke her heart t One class assignment. One second chance at love. The school player is all in. Now he needs to win back the sweet commitment girl who's forever owned his heart. Justin Carter has a secret. He's not the total player Fairfield Academy believes him to be. Not really. In fact, he used to be a one-woman guy...and his feelings for her never went away. Too bad he broke her heart three years ago and made sure to ruin any chance she'd ever forgive him. Peyton Williams is a liar. She pretends to be whole, counting down the days until graduation and helping her parents at the family ranch. But the truth is, she's done everything she can to get over Justin, and salvation is just around the corner. With graduation one short month away, she'll soon break free from the painful memories and start her life fresh. Of course, she has to get through working with him on one last assignment first. For Justin, nothing ever felt as right as being with Peyton, and now that fate's given him a shot at redemption, he's determined to make the most of it. And for Peyton...well, Justin Carter has always been her kryptonite.", "price": "45.22", "stock": "16", "image": "https://books.toscrape.com/../media/cache/da/b8/dab87c14168f3ce18530447ec6437361.jpg"}]