[{"upc": "23356462d1320d61", "name": "In Her Wake", "description": "A perfect life â\u0080¦ until she discovered it wasnâ\u0080\u0099t her own.A tragic family event reveals devastating news that rips apart Bellaâ\u0080\u0099s comfortable existence. Embarking on a personal journey to uncover the truth, she faces a series of traumatic discoveries that take her to the ruggedly beautiful Cornish coast, where hidden truths, past betrayals and a 25-year-old mystery threaten n A perfect life â\u0080¦ until she discovered it wasnâ\u0080\u0099t her own.A tragic family event reveals devastating news that rips apart Bellaâ\u0080\u0099s comfortable existence. Embarking on a personal journey to uncover the truth, she faces a series of traumatic discoveries that take her to the ruggedly beautiful Cornish coast, where hidden truths, past betrayals and a 25-year-old mystery threaten not just her identity, but also her life.Chilling, complex and profoundly moving, In Her Wake is a gripping psychological thriller that questions the nature of family â\u0080\u0093 and reminds us that sometimes the most shocking crimes are committed closest to home.", "price": "12.84", "stock": "19", "image": "https://books.toscrape.com/../media/cache/27/92/2792ef951651ff1eae40a410cac41e0f.jpg"}, {"upc": "327f68a59745c102", "name": "How Music Works", "description": "How Music Works is David Byrneâ\u0080\u0099s remarkable and buoyant celebration of a subject he has spent a lifetime thinking about. In it he explores how profoundly music is shaped by its time and place, and he explains how the advent of recording technology in the twentieth century forever changed our relationship to playing, performing, and listening to music.Acting as historian an How Music Works is David Byrneâ\u0080\u0099s remarkable and buoyant celebration of a subject he has spent a lifetime thinking about. In it he explores how profoundly music is shaped by its time and place, and he explains how the advent of recording technology in the twentieth century forever changed our relationship to playing, performing, and listening to music.Acting as historian and anthropologist, raconteur and social scientist, he searches for patternsâ\u0080\u0094and shows how those patterns have affected his own work over the years with Talking Heads and his many collaborators, from Brian Eno to Caetano Veloso. Byrne sees music as part of a larger, almost Darwinian pattern of adaptations and responses to its cultural and physical context. His range is panoptic, taking us from Wagnerian opera houses to African villages, from his earliest high school reel-to-reel recordings to his latest work in a home music studio (and all the big studios in between).Touching on the joy, the physics, and even the business of making music, How Music Works is a brainy, irresistible adventure and an impassioned argument about musicâ\u0080\u0099s liberating, life-affirming power.", "price": "37.32", "stock": "19", "image": "https://books.toscrape.com/../media/cache/1d/40/1d4087ff0a63f09fae9cd8433d21c2c4.jpg"}, {"upc": "5674a18a29a43ced", "name": "Foolproof Preserving: A Guide to Small Batch Jams, Jellies, Pickles, Condiments, and More: A Foolproof Guide to Making Small Batch Jams, Jellies, Pickles, Condiments, and More", "description": "Canning perfected the Americaâ\u0080\u0099s Test Kitchen way. The art of preserving produce by canning and preserving has come full circle from grandmother's kitchen to a whole new generation now eager to learn it. This detailed guide to home preserving is perfect for novice canners and experts alike and offers more than 100 foolproof recipes across a wide range of categories, from sw Canning perfected the Americaâ\u0080\u0099s Test Kitchen way. The art of preserving produce by canning and preserving has come full circle from grandmother's kitchen to a whole new generation now eager to learn it. This detailed guide to home preserving is perfect for novice canners and experts alike and offers more than 100 foolproof recipes across a wide range of categories, from sweet jams and jellies to savory jams, vegetables, condiments, pickles, whole fruits, and more. Let the experts at America's Test Kitchen show you how to do it right with detailed tutorials, troubleshooting tips, equipment information, and insight into the science behind canning.", "price": "30.52", "stock": "19", "image": "https://books.toscrape.com/../media/cache/9f/58/9f58d3ff6d58589eaf325b1a33c303a0.jpg"}, {"upc": "c2e46a2ee3b4a322", "name": "Chase Me (Paris Nights #2)", "description": "A Michelin two-star chef at twenty-eight, Violette Lenoir could handle anything, including a cocky burglar who broke into her restaurant in the middle of the night.Or so she thought.Elite counterterrorist operative Chase â\u0080\u009cSmithâ\u0080\u009d had been through things that made Hell Week look easy. But nothing had prepared him for a leather-clad blonde who held him at bay at knifepoint an A Michelin two-star chef at twenty-eight, Violette Lenoir could handle anything, including a cocky burglar who broke into her restaurant in the middle of the night.Or so she thought.Elite counterterrorist operative Chase â\u0080\u009cSmithâ\u0080\u009d had been through things that made Hell Week look easy. But nothing had prepared him for a leather-clad blonde who held him at bay at knifepoint and dared him to take her on.Now if only saving the world didnâ\u0080\u0099t require he ruin her life.Two people who thought they could handle anything now have to take on each other. It's a battle neither one expected. But with their futures on the line, they have nothing to lose...but their hearts.Warning: This book contains one arrogant Navy SEAL, nights of Paris passion, and a woman who wants to have it all.", "price": "25.27", "stock": "19", "image": "https://books.toscrape.com/../media/cache/6c/84/6c84fcf7a53b02b6e763de7272934842.jpg"}, {"upc": "00bfed9e18bb36f3", "name": "Black Dust", "description": "No matter how busy he keeps himself, successful Broadway musician Tobias Spence canâ\u0080\u0099t outrun the memory of a tragic car crash from his past that claimed a friendâ\u0080\u0099s life and permanently injured his former boyfriend, Emmett.Even after losing Tobias, Emmett Henderson made peace with that awful night, living in his Indiana hometown where he has become a revered choral director No matter how busy he keeps himself, successful Broadway musician Tobias Spence canâ\u0080\u0099t outrun the memory of a tragic car crash from his past that claimed a friendâ\u0080\u0099s life and permanently injured his former boyfriend, Emmett.Even after losing Tobias, Emmett Henderson made peace with that awful night, living in his Indiana hometown where he has become a revered choral director. When his students are asked to perform in New York City, he decides to chance reconnecting with his former love, if for no other reason than to get a proper goodbye.When Emmett and Tobias finally meet 15 years after parting ways, it is clear to both of them that their feelings for each other have not changed. As they explore their renewed relationship, the two men face old hurts and the new challenges of a long-distance romance. Will Tobias lose his second chance at love to the ghosts he canâ\u0080\u0099t seem to put to rest?", "price": "34.53", "stock": "19", "image": "https://books.toscrape.com/../media/cache/a4/0a/a40af95beab828af1a4757ad1ee17da3.jpg"}, {"upc": "9528d0948525bf5f", "name": "Birdsong: A Story in Pictures", "description": "Bring the thrilling story of one red bird to life. When an innocent bird meets two cruel kids, their world is forever changed. But exactly how that change unfolds is up to you, in the tradition of Kamishibaiâ\u0080\u0094Japanese paper theater. The wordless story by master cartoonist James Sturm is like a haikuâ\u0080\u0094the elegant images leave space for children to inhabit this timeless taleâ\u0080\u0094a Bring the thrilling story of one red bird to life. When an innocent bird meets two cruel kids, their world is forever changed. But exactly how that change unfolds is up to you, in the tradition of Kamishibaiâ\u0080\u0094Japanese paper theater. The wordless story by master cartoonist James Sturm is like a haikuâ\u0080\u0094the elegant images leave space for children to inhabit this timeless taleâ\u0080\u0094and make it their own, leading them to learn an ultimate lesson they'll never forget.James Sturm is the author of several books for kids including the Adventures in Cartooning series (with Andrew Arnold and Alexis Frederick-Frost) and the forthcoming Ape and Armadillo. James also helped start a college for cartoonists, The Center for Cartoon Studies, in the small railroad village of White River Junction, Vermont.", "price": "54.64", "stock": "19", "image": "https://books.toscrape.com/../media/cache/af/2f/af2fe2419ea136f2cd567aa92082c3ae.jpg"}, {"upc": "c7d160c2c0de586f", "name": "America's Cradle of Quarterbacks: Western Pennsylvania's Football Factory from Johnny Unitas to Joe Montana", "description": "Any fan of the Baltimore Colts of my era, any fan of my friend and teammate Johnny Unitas, or, for that matter, any fan of football in general should enjoy Wayne Stewart's book. It contains great stories, statistics, and information on all of the many great quarterbacks whocame out of Western Pennsylvania and much more. Raymond Berry NFL Hall of Fame Wide Receiver Itâ\u0080\u0099s wel Any fan of the Baltimore Colts of my era, any fan of my friend and teammate Johnny Unitas, or, for that matter, any fan of football in general should enjoy Wayne Stewart's book. It contains great stories, statistics, and information on all of the many great quarterbacks whocame out of Western Pennsylvania and much more. Raymond Berry NFL Hall of Fame Wide Receiver Itâ\u0080\u0099s well known that the NFL has been dominated through the years by quarterbacks sown and grown in a relatively small area surrounding the city of Pittsburgh in Western Pennsylvania. In Americaâ\u0080\u0099s Cradle of Quarterbacks, author Wayne Stewart not only tells us who they are, he digs deep to explain the nature and nurture behind the rich harvest of signal callers (Montana, Unitas, Marino, Namath, Kelly, Blanda, etc.) who have risen from that fertile soil to claim Lombardi Trophies and dominate the gallery of busts in the Pro Football Hall of Fame. Stewart has written a fascinating book that belongs on the shelves of football historians and everyday fans alike. Jeffrey J. Miller Author of Rockinâ\u0080\u0099 The Rockpile, Buffaloâ\u0080\u0099sForgotten Champions, and Game Changers", "price": "22.50", "stock": "19", "image": "https://books.toscrape.com/../media/cache/a3/2a/a32ab3b8c024c6c2b274a86b185e7585.jpg"}, {"upc": "904208d6aa64b655", "name": "Aladdin and His Wonderful Lamp", "description": "Planning on seeing Aladdin the Disney musical? Read the classic story of \"Aladdin and his Wonderful Lamp\" in this sparkling new edition by Harpendore. Synopsis: Aladdin is a poor boy who lives with his mother in the ancient kingdom of Cathay. One day a strange man appears offering untold riches! Aladdin is not so sure, yet he's sorely tempted. Join Aladdin on his incredib Planning on seeing Aladdin the Disney musical? Read the classic story of \"Aladdin and his Wonderful Lamp\" in this sparkling new edition by Harpendore. Synopsis: Aladdin is a poor boy who lives with his mother in the ancient kingdom of Cathay. One day a strange man appears offering untold riches! Aladdin is not so sure, yet he's sorely tempted. Join Aladdin on his incredible adventures and visit the cave of treasures. A world of magic awaits you, but watch your step - there's mischief lurking at every turn! The Arabian Nights (also known as The One Thousand and One Nights) is an ancient collection of tales that have existed for thousands of years. Harpendore's Arabian Nights Adventures are beautifully retold versions of these ancient classics that are specially designed to appeal to children aged seven years and above. They are written in a warm and accessible style and include wonderful illustrations inside. With mischief and magic in equal measure, this series is sure to captivate readers everywhere. The Arabian Nights Adventures series is being released throughout 2016 and 2017. Stories to be included are: The Adventures of Prince Camar & Princess Badoura Aladdin and his Wonderful Lamp Gulnare of the Sea Ali Baba and the Forty Thieves The Seven Voyages of Sinbad the Sailor The Enchanted Horse The Talking Bird, the Singing Tree and the Golden Water The Merchant and the Genie The Tale of Zubaidah and the Three Qalandars The Adventures of Harun al-Rashid, Caliph of Baghdad The Three Princes, the Princess and the Jinni Pari Banou The Fisherman and the Genie The King's Jester (also known as The Little Hunchback)", "price": "53.13", "stock": "19", "image": "https://books.toscrape.com/../media/cache/a8/3c/a83c460fab82f35a37c0846729485547.jpg"}, {"upc": "4c28def39d850cdf", "name": "Worlds Elsewhere: Journeys Around Shakespeareâ\u0080\u0099s Globe", "description": "Anti-apartheid activist, Bollywood screenwriter, Nazi pin-up, hero of the Wild West: this is Shakespeare as you have never seen him before.From the sixteenth-century Baltic to the American Revolution, from colonial India to the skyscrapers of modern-day Shanghai, Shakespeareâ\u0080\u0099s plays appear at the most fascinating of times and in the most unexpected of places. No other writ Anti-apartheid activist, Bollywood screenwriter, Nazi pin-up, hero of the Wild West: this is Shakespeare as you have never seen him before.From the sixteenth-century Baltic to the American Revolution, from colonial India to the skyscrapers of modern-day Shanghai, Shakespeareâ\u0080\u0099s plays appear at the most fascinating of times and in the most unexpected of places. No other writerâ\u0080\u0099s work has been performed, translated, adapted and altered in such a remarkable variety of cultures and languages. But what is it about William Shakespeare â\u0080\u0093 a man from Warwickshire who never once set foot outside England â\u0080\u0093 that has made him at home in so many places around the globe?Travelling across four continents, six countries and 400 years, Andrew Dickson takes us on a personal journey rich in insight and surprise. We enter the air-conditioned vault deep beneath Capitol Hill where the worldâ\u0080\u0099s largest collection of First Folios is stored; discover the shadowy history of Joseph Goebbelsâ\u0080\u0099s obsession with Shakespeare; and uncover the true story behind the scuffed edition in which Nelson Mandela and fellow Robben Island prisoners inscribed their names. Both cultural history and literary travelogue, Worlds Elsewhere is an attempt to understand how Shakespeare has become the international phenomenon he is â\u0080\u0093 and why.\"There were very few pages on which I didnâ\u0080\u0099t learn something new or revelatory. A must-read for anyone interested in Shakespeareâ\u0080\u0099s impact on people and politics around the globe\" (James Shapiro, author of 1599: A Year in the Life of William Shakespeare)\"Immensely well-informed and highly readable. A revelatory journey of cultural exploration\" (Professor Stanley Wells, General Editor of the Oxford and Penguin Shakespeares)\"Brilliantly original. Absolutely engaging, witty and irresistible. Whatâ\u0080\u0099s most remarkable: heâ\u0080\u0099s said something new about Shakespeare\" (Michael Pye, author of The Edge of the World)\"A truly original book about Shakespeare: one that explores the dramatist's global reach with tenacity, devotion and an exhilarating spirit of adventure\" (Michael Billington)", "price": "40.30", "stock": "18", "image": "https://books.toscrape.com/../media/cache/7b/d9/7bd93db091d736d0c6ff9d578e3ba3d7.jpg"}, {"upc": "ccd9ffa25efabdea", "name": "Wall and Piece", "description": "Banksy, Britain's now-legendary \"guerilla\" street artist, has painted the walls, streets, and bridges of towns and cities throughout the world. Not only did he smuggle his pieces into four of New York City's major art museums, he's also \"hung\" his work at London's Tate Gallery and adorned Israel's West Bank barrier with satirical images. Banksy's identity remains unknown, Banksy, Britain's now-legendary \"guerilla\" street artist, has painted the walls, streets, and bridges of towns and cities throughout the world. Not only did he smuggle his pieces into four ofÂ  New York City's major art museums, he's also \"hung\" his work at London's Tate Gallery and adorned Israel's West Bank barrier with satirical images. Banksy's identity remains unknown, but his work is unmistakableâ\u0080\u0094with prints selling for as much as $45,000.", "price": "44.18", "stock": "18", "image": "https://books.toscrape.com/../media/cache/df/34/df346322ddfdd3b4da0e34cad17f49dc.jpg"}, {"upc": "6258a1f6a6dcfe50", "name": "The Four Agreements: A Practical Guide to Personal Freedom", "description": "In The Four Agreements, don Miguel Ruiz reveals the source of self-limiting beliefs that rob us of joy and create needless suffering. Based on ancient Toltec wisdom, the Four Agreements offer a powerful code of conduct that can rapidly transform our lives to a new experience of freedom, true happiness, and love. The Four Agreements are: Be Impeccable With Your Word, Don't In The Four Agreements, don Miguel Ruiz reveals the source of self-limiting beliefs that rob us of joy and create needless suffering. Based on ancient Toltec wisdom, the Four Agreements offer a powerful code of conduct that can rapidly transform our lives to a new experience of freedom, true happiness, and love. The Four Agreements are: Be Impeccable With Your Word, Don't Take Anything Personally, Don't Make Assumptions, Always Do Your Best.", "price": "17.66", "stock": "18", "image": "https://books.toscrape.com/../media/cache/2b/1b/2b1bfecae9d512cb6ee943ccf786216f.jpg"}, {"upc": "3c039985229453bf", "name": "The Five Love Languages: How to Express Heartfelt Commitment to Your Mate", "description": "Are you and your spouse speaking the same language? While love is a many splendored thing, it is sometimes a very confusing thing, too. And as people come in all varieties, shapes, and sizes, so do their choices of personal expressions of love. But more often than not, the giver and the receiver express love in two different ways. This can lead to misunderstanding, quarrel Are you and your spouse speaking the same language? While love is a many splendored thing, it is sometimes a very confusing thing, too. And as people come in all varieties, shapes, and sizes, so do their choices of personal expressions of love. But more often than not, the giver and the receiver express love in two different ways. This can lead to misunderstanding, quarrels, and even divorce.Quality time, words of affirmation, gifts, acts of service, and physical touch are the five basic love languages. Dr. Gary Chapman identifies these and guides couples towards a better understanding of their unique languages of love. Learn to speak and understand your mate's love language, and in no time you will be able to effectively love and truly feel loved in return. Skillful communication is within your grasp!", "price": "31.05", "stock": "18", "image": "https://books.toscrape.com/../media/cache/7c/10/7c10101fe1759c5a17ba57e4bef9e764.jpg"}, {"upc": "5dada2b7be26bd03", "name": "The Elephant Tree", "description": "Mark Fallon is an overworked detective investigating a spate of attacks at a string of high profile city centre nightclubs. Scott is a dejected 24 year old struggling to make ends meet working for his brother and supplementing his income with a small-scale drug dealing operation. Angela is an attractive 23 year old, raised by her father, a career criminal and small time dr Mark Fallon is an overworked detective investigating a spate of attacks at a string of high profile city centre nightclubs. Scott is a dejected 24 year old struggling to make ends meet working for his brother and supplementing his income with a small-scale drug dealing operation. Angela is an attractive 23 year old, raised by her father, a career criminal and small time drug dealer who supplies Scott with cannabis. This is a chilling tale spanning a few months in the lives of Scott and Angela, where realizations about the present combine with shocking revelations from the past leading to an apocalyptic climax where they no longer know whom they can trust.", "price": "23.82", "stock": "18", "image": "https://books.toscrape.com/../media/cache/4b/80/4b80a3d9148e224ed4d6cd4d33f43728.jpg"}, {"upc": "9f6568e9c95f60b0", "name": "The Bear and the Piano", "description": "One day, a young bear stumbles upon something he has never seen before in the forest. As time passes, he teaches himself how to play the strange instrument, and eventually the beautiful sounds are heard by a father and son who are picnicking in the woods. The bear goes with them on an incredible journey to New York, where his piano playing makes him a huge star. He has fam One day, a young bear stumbles upon something he has never seen before in the forest. As time passes, he teaches himself how to play the strange instrument, and eventually the beautiful sounds are heard by a father and son who are picnicking in the woods. The bear goes with them on an incredible journey to New York, where his piano playing makes him a huge star. He has fame, fortune and all the music in the world, but he misses the friends and family he has left behind. A moving tale of exploration and belonging from an exciting debut author-illustrator.", "price": "36.89", "stock": "18", "image": "https://books.toscrape.com/../media/cache/d0/87/d0876dcd1a6530a4cb54903aad7a3e28.jpg"}, {"upc": "6be3beb0793a53e7", "name": "Sophie's World", "description": "A page-turning novel that is also an exploration of the great philosophical concepts of Western thought, Sophieâ\u0080\u0099s World has fired the imagination of readers all over the world, with more than twenty million copies in print.One day fourteen-year-old Sophie Amundsen comes home from school to find in her mailbox two notes, with one question on each: â\u0080\u009cWho are you?â\u0080\u009d and â\u0080\u009cWhere A page-turning novel that is also an exploration of the great philosophical concepts of Western thought, Sophieâ\u0080\u0099s World has fired the imagination of readers all over the world, with more than twenty million copies in print.One day fourteen-year-old Sophie Amundsen comes home from school to find in her mailbox two notes, with one question on each: â\u0080\u009cWho are you?â\u0080\u009d and â\u0080\u009cWhere does the world come from?â\u0080\u009d From that irresistible beginning, Sophie becomes obsessed with questions that take her far beyond what she knows of her Norwegian village. Through those letters, she enrolls in a kind of correspondence course, covering Socrates to Sartre, with a mysterious philosopher, while receiving letters addressed to another girl. Who is Hilde? And why does her mail keep turning up? To unravel this riddle, Sophie must use the philosophy she is learningâ\u0080\u0094but the truth turns out to be far more complicated than she could have imagined.", "price": "15.94", "stock": "18", "image": "https://books.toscrape.com/../media/cache/d7/39/d73914232130fdf90d66f02fd9798f2b.jpg"}, {"upc": "668fe56b17cfcd4f", "name": "Penny Maybe", "description": "Sent to yet another foster family, Penny decides that the way to claim a sense of self is to swim Lake Ontario. Although this seems impossible, she finds the courage to ask her physics teacher to be her coach, and wins the support of her new foster", "price": "33.29", "stock": "18", "image": "https://books.toscrape.com/../media/cache/b1/4b/b14be641ab97a330891455a769d52fd3.jpg"}, {"upc": "094b269567e1c300", "name": "Maude (1883-1993):She Grew Up with the country", "description": "This new edition of Maude (1883-1993) has been updated by Mardo Williamsâ\u0080\u0099 daughters, adding historical details their dad wished to make, twice as many photos, and nine appendices not present in the 1996 hardcover (which won an Ohioana Library Award for its author). During her 110-year lifetime, Maude went from a 400-lb. wood-burning stove to a microwave oven, from an outdo This new edition of Maude (1883-1993) has been updated by Mardo Williamsâ\u0080\u0099 daughters, adding historical details their dad wished to make, twice as many photos, and nine appendices not present in the 1996 hardcover (which won an Ohioana Library Award for its author). During her 110-year lifetime, Maude went from a 400-lb. wood-burning stove to a microwave oven, from an outdoor privy to indoor plumbing. She got the vote in 1920 and voted in the next 18 Presidential elections.With poetry and human dramas (two murders and a suicide), written by a master journalist, the book shows the impact of the changing times on shy, unassuming Maude, her fun-loving husband Lee, and their four active children. They farmed 100 acres on the banks of Rush Creek in Logan County (Ohio).A favorite with book discussion groups, Maude has been adopted by several colleges for use as a supplemental American history text.", "price": "18.02", "stock": "18", "image": "https://books.toscrape.com/../media/cache/65/bf/65bfa3acc93b0e558a1c3de1b1164742.jpg"}, {"upc": "19ed25f4641d5efd", "name": "In a Dark, Dark Wood", "description": "In a dark, dark wood Nora hasn't seen Clare for ten years. Not since Nora walked out of school one day and never went back. There was a dark, dark houseUntil, out of the blue, an invitation to Clareâ\u0080\u0099s hen do arrives. Is this a chance for Nora to finally put her past behind her?And in the dark, dark house there was a dark, dark roomBut something goes wrong. Very wrong.And i In a dark, dark wood Nora hasn't seen Clare for ten years. Not since Nora walked out of school one day and never went back. There was a dark, dark houseUntil, out of the blue, an invitation to Clareâ\u0080\u0099s hen do arrives. Is this a chance for Nora to finally put her past behind her?And in the dark, dark house there was a dark, dark roomBut something goes wrong. Very wrong.And in the dark, dark room.... Some things canâ\u0080\u0099t stay secret for ever.", "price": "19.63", "stock": "18", "image": "https://books.toscrape.com/../media/cache/95/84/95840dfd67c020067c99d70451147e20.jpg"}, {"upc": "be5cc846f45496fb", "name": "Behind Closed Doors", "description": "The 2016 debut bloggers can't stop raving about. Perfect for fans of The Girl on the Train and The Ice Twins Everyone knows a couple like Jack and Grace.He has looks and wealth, she has charm and elegance. You might not want to like them, but you do. Though, youâ\u0080\u0099d like to get to know Grace better.But itâ\u0080\u0099s difficult, because you realise Jack and Grace are never apart.Some The 2016 debut bloggers can't stop raving about. Perfect for fans of The Girl on the Train and The Ice Twins Everyone knows a couple like Jack and Grace.He has looks and wealth, she has charm and elegance. You might not want to like them, but you do. Though, youâ\u0080\u0099d like to get to know Grace better.But itâ\u0080\u0099s difficult, because you realise Jack and Grace are never apart.Some might call this true love. Others might ask why Grace never answers the phone. Or how she can never meet for coffee, even though she doesnâ\u0080\u0099t work. How she can cook such elaborate meals but remain so slim. And why there are bars on one of the bedroom windows.Sometimes, the perfect marriage is the perfect lie.", "price": "52.22", "stock": "18", "image": "https://books.toscrape.com/../media/cache/a5/85/a58571db229f2e8f75ea38861eca7f39.jpg"}, {"upc": "55f9da0c5eea2e10", "name": "You can't bury them all: Poems", "description": "A poetry that is at once harrowing, angry, and achingly beautiful Patrick Woodcock has spent the past seven years engaging with and being shaped by the people, politics, and landscapes of the Kurdish north of Iraq, Fort Good Hope in the Northwest Territories, and Azerbaijan. His powerful new collection offers a poetry that simultaneously explores hope and horror while doc A poetry that is at once harrowing, angry, and achingly beautiful Patrick Woodcock has spent the past seven years engaging with and being shaped by the people, politics, and landscapes of the Kurdish north of Iraq, Fort Good Hope in the Northwest Territories, and Azerbaijan. His powerful new collection offers a poetry that simultaneously explores hope and horror while documenting the transformative processes of coping. You canâ\u0080\u0099t bury them all follows the narratives we construct to survive the tragic failures of our humanity to their very end: everything thatâ\u0080\u0099s buried by snow, dirt, and ash, just like everything thatâ\u0080\u0099s buried by politics, homophobia, sexism, racism, religion; and history is resurrected, demanding to be heard and addressed.In Woodcockâ\u0080\u0099s poetry, how we deal with what resurfaces is the key. What do those who suffer really mean to those who have abandoned them to small, conscience-soothing charitable donations or the occasional tweet? How can the poet, or anyone else, sleep at night knowing homosexuals are being thrown off building tops, after one steps into a hole and finds an abandoned corpse in an Azeri cemetery, or after the elders of an Aboriginal community are left helpless against those who only want to exploit them? Still, You canâ\u0080\u0099t bury them all demonstrates that the world is not just the horrific place the media often portrays. In each of the worlds he touches, Woodcock discovers a spirit and strength to celebrate.", "price": "33.63", "stock": "17", "image": "https://books.toscrape.com/../media/cache/b7/44/b7440aa88046b0bf8cba50d59295518e.jpg"}]